006_bubble2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (20 0 0)
    (20 1 0)
    (0 1 0)

    (0 0 50)
    (20 0 50)
    (20 1 50)
    (0 1 50)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 1 100) simpleGrading (1 1 1)
);

defaultPatch
{
    type empty;
}

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (1 2 6 5)
            (0 3 7 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
