006_bubble2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceGrabbed_1; // 空气入口
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.06 -1 -0.0001) (0.0625 1 0.0001); // Edit box bounds as required
    }
    {
        name    faceGrabbed_1;
        type    faceSet;
        action  add;
        source  boxToFace;
        box     (0.1375 -1 -0.0001) (0.14 1 0.0001); // Edit box bounds as required
    }
    {
        name    faceGrabbed_2; // 水的入口
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.199 -1 0.05) (0.201 1 0.06); // Edit box bounds as required
    }
    {
        name    faceGrabbed_3; // 溢流口
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0 -1 -0.0001) (0.04 1 0.0001); // Edit box bounds as required
    }
    {
        // 清空已有的set或建立一个空的set，无需设置source和sourceInfo，
        // 若对已存在的set进行操作，则会清空该set；若对不存在的set操作，
        // 则会创建一个空set，此处表示创建一个空set
        name    overFlowWall; // 溢流墙壁
        type    cellSet;
        action  clear;        
    }
    {
        // 无需设置source和sourceInfo
        name    overFlowWall;
        type    cellSet;
        action  invert;
    }
    {
        name    overFlowWall;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.04 -1 0) (0.05 1 0.4);
        }
    }
);

// ************************************************************************* //
